# Scraping Data from a Real Website + Pandas

In [2]:
from bs4 import BeautifulSoup
import requests

In [3]:
url = 'https://en.wikipedia.org/wiki/List_of_largest_companies_in_the_United_States_by_revenue'

page = requests.get(url)

soup = BeautifulSoup(page.text, 'html')

In [4]:
print(soup)

In [5]:
soup.find('table')

In [7]:
soup.find_all('table')[1]

In [9]:
soup.find('table', class_ = 'wikitable sortable')

In [10]:
table = soup.find_all('table')[1]

In [11]:
 print(table)

In [12]:
world_titles = table.find_all('th')

In [13]:
world_titles

[<th>Rank
 </th>,
 <th>Name
 </th>,
 <th>Industry
 </th>,
 <th>Revenue <br/>(USD billions)
 </th>,
 <th>Employees
 </th>,
 <th>Headquarters
 </th>]

In [23]:
world_table_titles = [title.text.strip() for title in world_titles]

print(world_table_titles)

['Rank', 'Name', 'Industry', 'Revenue (USD billions)', 'Employees', 'Headquarters']

In [24]:
import pandas as pd

In [25]:
df = pd.DataFrame(columns = world_table_titles)

df

Empty DataFrame
Columns: [Rank, Name, Industry, Revenue (USD billions), Employees, Headquarters]
Index: []

In [26]:
column_data = table.find_all('tr')

In [27]:
for row in column_data[1:]:
    row_data = row.find_all('td')
    individual_row_data = [data.text.strip() for data in row_data]
    
    length = len(df)
    df.loc[length] = individual_row_data

In [28]:
df

,Rank,Name,Industry,Revenue (USD billions),Employees,Headquarters
0,1,Cargill,Food industry,177,"160,000","Minnetonka, Minnesota"
1,2,Koch Industries,Conglomerate,125,"120,000","Wichita, Kansas"
2,3,Publix Super Markets,Retail,54.5,"250,000","Winter Haven, Florida"
3,4,"Mars, Incorporated",Food industry,47,"140,000","McLean, Virginia"
4,5,H-E-B,Retail,43.6,"145,000","San Antonio, Texas"
5,6,Reyes Holdings,Wholesaling,40,"36,000","Rosemont, Illinois"
6,7,Enterprise Holdings,Car rental,35,"90,000","Clayton, Missouri"
7,8,C&S Wholesale Grocers,Wholesaling,34.7,"15,000","Keene, New Hampshire"
8,9,Love's,Petroleum industry and Retail,26.5,"40,000","Oklahoma City, Oklahoma"
9,10,Southern Glazer's Wine and Spirits,Food industry,26.0,"24,000","Miramar, Florida"

In [21]:
df.to_csv(r'C:\Users\mpmac\Web_Scraping\Companies.csv', index = False)

## Scraping the main table (Top 100 Companies) from this Website

In [55]:
from bs4 import BeautifulSoup
import requests

In [56]:
url = 'https://en.wikipedia.org/wiki/List_of_largest_companies_in_the_United_States_by_revenue'

page = requests.get(url)

soup = BeautifulSoup(page.text, 'html')

In [81]:
print(soup1)

In [80]:
soup1.find('table')

In [79]:
soup1.find_all('table')[0]

In [78]:
soup1.find('table', class_ = 'wikitable sortable')

In [61]:
table0 = soup1.find_all('table')[0]

In [76]:
 print(table0)

In [63]:
world_titles_1 = table0.find_all('th')

In [77]:
world_titles_1

In [65]:
world_table_titles_1 = [title.text.strip() for title in world_titles_1]

print(world_table_titles_1)

['Rank', 'Name', 'Industry', 'Revenue (USD millions)', 'Revenue growth', 'Employees', 'Headquarters']

In [66]:
import pandas as pd

In [67]:
df1 = pd.DataFrame(columns = world_table_titles_1)

df1

Empty DataFrame
Columns: [Rank, Name, Industry, Revenue (USD millions), Revenue growth, Employees, Headquarters]
Index: []

In [68]:
column_data_1 = table0.find_all('tr')

In [69]:
for row in column_data_1[1:]:
    row_data = row.find_all('td')
    individual_row_data = [data.text.strip() for data in row_data]
    
    length1 = len(df1)
    df1.loc[length1] = individual_row_data

In [70]:
df1

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,"648,125",6.0%,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,"574,785",11.9%,"1,525,000","Seattle, Washington"
2,3,Apple,Electronics industry,"383,482",-2.8%,"161,000","Cupertino, California"
3,4,UnitedHealth Group,Healthcare,"371,622",14.6%,"440,000","Minnetonka, Minnesota"
4,5,Berkshire Hathaway,Conglomerate,"364,482",20.7%,"396,500","Omaha, Nebraska"
...,...,...,...,...,...,...,...
95,96,TIAA,Financials,"45,735",11.8%,"16,023","New York City, New York"
96,97,CHS,Agriculture cooperative,"45,590",-4.6%,"10,609","Inver Grove Heights, Minnesota"
97,98,Bristol-Myers Squibb,Pharmaceutical industry,"45,006",-2.5%,"34,100","New York City, New York"
98,99,Dow Chemical Company,Chemical industry,"44,622",-21.6%,"35,900","Midland, Michigan"
99,100,Best Buy,Retail,"43,452",-6.1%,"85,000","Richfield, Minnesota"

In [71]:
df1.to_csv(r'C:\Users\mpmac\Web_Scraping\Top_100Companies.csv', index = False)

##  WebScraping Companies by Profit

In [82]:
from bs4 import BeautifulSoup
import requests

In [88]:
url = 'https://en.wikipedia.org/wiki/List_of_largest_companies_in_the_United_States_by_revenue'

page = requests.get(url)

soup2 = BeautifulSoup(page.text, 'html')

In [107]:
print(soup2)

In [108]:
soup2.find('table')

In [110]:
soup2.find_all('table')[2]

In [111]:
soup2.find('table', class_ = 'wikitable sortable')

In [94]:
table2 = soup2.find_all('table')[2]

In [96]:
print(table2)

In [97]:
world_titles_2 = table2.find_all('th')

In [98]:
world_titles_2

[<th>Rank
 </th>,
 <th>Name
 </th>,
 <th>Industry
 </th>,
 <th>Profits<br/>(USD millions)
 </th>]

In [99]:
world_table_titles_2 = [title.text.strip() for title in world_titles_2]

print(world_table_titles_2)

['Rank', 'Name', 'Industry', 'Profits(USD millions)']

In [100]:
import pandas as pd

In [101]:
df2 = pd.DataFrame(columns = world_table_titles_2)

df2

Empty DataFrame
Columns: [Rank, Name, Industry, Profits(USD millions)]
Index: []

In [102]:
column_data_1 = table2.find_all('tr')

In [103]:
for row in column_data_1[1:]:
    row_data = row.find_all('td')
    individual_row_data = [data.text.strip() for data in row_data]
    
    length2 = len(df2)
    df2.loc[length2] = individual_row_data

In [104]:
df2

  Rank                Name                 Industry Profits(USD millions)
0    1               Apple              Electronics                96,995
1    2  Berkshire Hathaway             Conglomerate                96,223
2    3            Alphabet               Technology                73,795
3    4           Microsoft               Technology                72,361
4    5      JPMorgan Chase               Financials                49,552
5    6      Meta Platforms               Technology                39,098
6    7          ExxonMobil       Petroleum industry                36,010
7    8   Johnson & Johnson  Pharmaceutical industry                35,153
8    9              Amazon        Retail/Technology                30,425
9   10              Nvidia               Technology                29,760

In [106]:
df2.to_csv(r'C:\Users\mpmac\Web_Scraping\Top_10_Companies_by_Profit.csv', index = False)